templates/0_org/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    Mammut
    {
        type	        omegaWallFunction;
        value           $internalField;
    }

    wand
    {
        type	        omegaWallFunction;
        value           $internalField;
    }

    boden
    {
        type	        omegaWallFunction;
        value           $internalField;
    }

    oben
    {
        type	        slip;
    }

}

// ************************************************************************* //
