templates/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zone1
{

    cellZone    cell_Mammut;
    active      yes;


    origin    (10.401924 -1.5 3);
    axis      (0.45 0.259808 0.3);

    rpm       -80;

}



// ************************************************************************* //
