templates/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh on;
snap            on;
addLayers       on;

geometry
{

    anlage
    {
        type closedTriSurfaceMesh;
        file "anlage.stl";

        regions
        {
            oben
            {
                name oben;
            }

            wand
            {
                name wand;
            }

            boden
            {
                name boden;
            }
        }
    }

    Mammut
    {
        type closedTriSurfaceMesh;
        file "Mammut.obj";
    }

    Mammut_MRF
    {
        type closedTriSurfaceMesh;
        file "Mammut_MRF.obj";
    }

};

castellatedMeshControls
{
    features
    (
        {file "Mammut.eMesh";level 4;}
        {file "anlage.eMesh";level 1;}
        {file "Mammut_MRF.eMesh";level 3;}
    );

    insidePoint (5.0001 5.0001 0.1);

    refinementSurfaces
    {
        anlage
        {
            level (1 1);
            boden
            {
                level (2 2);
                patchInfo
                {
                    type wall;
                }
            }

            wand
            {
                level (2 2);
                patchInfo
                {
                    type wall;
                }
            }        

            oben
            {
                level (2 2);
                patchInfo
                {
                    type patch;
                }
            }
        }

        Mammut_MRF
        {
            level (2 2);
            
            cellZone cell_Mammut;
            faceZone face_Mammut;

	    	faceType internal;

	    	cellZoneInside insidePoint;
            //cellZoneInside inside;
            insidePoint (11 -1.2 3.4);            
        }

        Mammut
        {
            level (4 5);
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 60;
    
    refinementRegions
    {
        Mammut
        {
            mode distance;
            levels ((0.05 3));
        }

        Mammut_MRF
        {
            mode  inside;
            level 3;
        }

    }

}

snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;

    // Maximum relative distance for points to be attracted by surface.
    // True distance is this factor times local maximum edge length.
    // Note: changed(corrected) w.r.t 17x! (17x used 2* tolerance)
    tolerance 3.0;

    // Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter 15;

        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap false;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        // Detect features between multiple surfaces
        // (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap false;
}

addLayersControls
{
    layers
    {
        boden
        {
            nSurfaceLayers 5;
        }

        wand
        {
            nSurfaceLayers 5;
        }

        oben
        {
            nSurfaceLayers 10;
        }

        Mammut
        {
            nSurfaceLayers 5;
        }
    }

    relativeSizes       true;
    expansionRatio      1.2;
    finalLayerThickness 0.5;
    minThickness        1e-3;
    featureAngle        180;
}

writeFlags
(
);

mergeTolerance 1e-6;

// ************************************************************************* //
